---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCAnyHandle
source: html/568bb8e2-93ea-edcb-57ce-4d1222f3f092.htm
---
# IFCAnyHandle Methods

Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef